lvgl/lv_port_stm32f469_disco/hal_stm_lvgl/tft/tft.c
   Dma2dHandle.Init.Mode         = DMA2D_R2M;
   /* DMA2D Initialization */
   if(HAL_DMA2D_Init(&Dma2dHandle) != HAL_OK)
   {
     /* Initialization Error */
     while(1);
   }

   Dma2dHandle.LayerCfg[1].InputAlpha = 0xff;
   HAL_DMA2D_ConfigLayer(&Dma2dHandle, 1);

   lv_color_t * dest_buf_ofs = dest_buf;

   dest_buf_ofs += dest_width * fill_area->y1;
   dest_buf_ofs += fill_area->x1;
   lv_coord_t area_w = lv_area_get_width(fill_area);

   uint32_t i;
   for(i = fill_area->y1; i <= fill_area->y2; i++) {
	   /*Wait for the previous operation*/
	   HAL_DMA2D_PollForTransfer(&Dma2dHandle, 100);
	   HAL_DMA2D_BlendingStart(&Dma2dHandle, (uint32_t) lv_color_to32(color), (uint32_t) dest_buf_ofs, (uint32_t)dest_buf_ofs, area_w, 1);
	   dest_buf_ofs += dest_width;
   }
}


#endif

static void LCD_Config(void)
{
	LTDC_LayerCfgTypeDef pLayerCfg;
	DSI_PLLInitTypeDef dsiPllInit;
	DSI_PHY_TimerTypeDef  PhyTimings;
	static RCC_PeriphCLKInitTypeDef  PeriphClkInitStruct;
	uint32_t LcdClock  = 27429; /*!< LcdClk = 27429 kHz */

	uint32_t laneByteClk_kHz = 0;
	uint32_t                   VSA; /*!< Vertical start active time in units of lines */
	uint32_t                   VBP; /*!< Vertical Back Porch time in units of lines */
	uint32_t                   VFP; /*!< Vertical Front Porch time in units of lines */
	uint32_t                   VACT; /*!< Vertical Active time in units of lines = imageSize Y in pixels to display */
	uint32_t                   HSA; /*!< Horizontal start active time in units of lcdClk */
	uint32_t                   HBP; /*!< Horizontal Back Porch time in units of lcdClk */
	uint32_t                   HFP; /*!< Horizontal Front Porch time in units of lcdClk */
	uint32_t                   HACT; /*!< Horizontal Active time in units of lcdClk = imageSize X in pixels to display */

	/* Toggle Hardware Reset of the DSI LCD using
	* its XRES signal (active low) */
	BSP_LCD_Reset();

	/* Call first MSP Initialize only in case of first initialization
	* This will set IP blocks LTDC, DSI and DMA2D
	* - out of reset
	* - clocked
	* - NVIC IRQ related to IP blocks enabled
	*/
	BSP_LCD_MspInit();

	/*************************DSI Initialization***********************************/

	/* Base address of DSI Host/Wrapper registers to be set before calling De-Init */
	hdsi_eval.Instance = DSI;

	HAL_DSI_DeInit(&(hdsi_eval));

	#if !defined(USE_STM32469I_DISCO_REVA)
		dsiPllInit.PLLNDIV  = 125;
		dsiPllInit.PLLIDF   = DSI_PLL_IN_DIV2;
		dsiPllInit.PLLODF   = DSI_PLL_OUT_DIV1;
	#else
		dsiPllInit.PLLNDIV  = 100;
		dsiPllInit.PLLIDF   = DSI_PLL_IN_DIV5;
		dsiPllInit.PLLODF   = DSI_PLL_OUT_DIV1;
	#endif
	laneByteClk_kHz = 62500; /* 500 MHz / 8 = 62.5 MHz = 62500 kHz */

	/* Set number of Lanes */
	hdsi_eval.Init.NumberOfLanes = DSI_TWO_DATA_LANES;

	/* TXEscapeCkdiv = f(LaneByteClk)/15.62 = 4 */
	hdsi_eval.Init.TXEscapeCkdiv = laneByteClk_kHz/15620;

	HAL_DSI_Init(&(hdsi_eval), &(dsiPllInit));

	/* Timing parameters for all Video modes
	*/
	// portrait
//	uint32_t lcd_x_size = OTM8009A_480X800_WIDTH;  /* 480 */
//	uint32_t lcd_y_size = OTM8009A_480X800_HEIGHT; /* 800 */
	// landscape
	uint32_t lcd_x_size = OTM8009A_800X480_WIDTH;  /* 800 */
	uint32_t lcd_y_size = OTM8009A_800X480_HEIGHT; /* 480 */

	HACT = lcd_x_size;
	VACT = lcd_y_size;

	/* The following values are same for portrait and landscape orientations */
	VSA  = OTM8009A_480X800_VSYNC;
	VBP  = OTM8009A_480X800_VBP;
	VFP  = OTM8009A_480X800_VFP;
	HSA  = OTM8009A_480X800_HSYNC;
	HBP  = OTM8009A_480X800_HBP;
	HFP  = OTM8009A_480X800_HFP;


	hdsivideo_handle.VirtualChannelID = LCD_OTM8009A_ID;
	hdsivideo_handle.ColorCoding = LCD_DSI_PIXEL_DATA_FMT_RBG565;
	hdsivideo_handle.VSPolarity = DSI_VSYNC_ACTIVE_HIGH;
	hdsivideo_handle.HSPolarity = DSI_HSYNC_ACTIVE_HIGH;
	hdsivideo_handle.DEPolarity = DSI_DATA_ENABLE_ACTIVE_HIGH;
	hdsivideo_handle.Mode = DSI_VID_MODE_BURST; /* Mode Video burst ie : one LgP per line */
	hdsivideo_handle.NullPacketSize = 0xFFF;
	hdsivideo_handle.NumberOfChunks = 0;
	hdsivideo_handle.PacketSize                = HACT; /* Value depending on display orientation choice portrait/landscape */
	hdsivideo_handle.HorizontalSyncActive      = (HSA * laneByteClk_kHz) / LcdClock;
	hdsivideo_handle.HorizontalBackPorch       = (HBP * laneByteClk_kHz) / LcdClock;
	hdsivideo_handle.HorizontalLine            = ((HACT + HSA + HBP + HFP) * laneByteClk_kHz) / LcdClock; /* Value depending on display orientation choice portrait/landscape */
	hdsivideo_handle.VerticalSyncActive        = VSA;
	hdsivideo_handle.VerticalBackPorch         = VBP;
	hdsivideo_handle.VerticalFrontPorch        = VFP;
	hdsivideo_handle.VerticalActive            = VACT; /* Value depending on display orientation choice portrait/landscape */

	/* Enable or disable sending LP command while streaming is active in video mode */
	hdsivideo_handle.LPCommandEnable = DSI_LP_COMMAND_ENABLE; /* Enable sending commands in mode LP (Low Power) */

	/* Largest packet size possible to transmit in LP mode in VSA, VBP, VFP regions */
	/* Only useful when sending LP packets is allowed while streaming is active in video mode */
	hdsivideo_handle.LPLargestPacketSize = 16;

	/* Largest packet size possible to transmit in LP mode in HFP region during VACT period */
	/* Only useful when sending LP packets is allowed while streaming is active in video mode */
	hdsivideo_handle.LPVACTLargestPacketSize = 0;


	/* Specify for each region of the video frame, if the transmission of command in LP mode is allowed in this region */
	/* while streaming is active in video mode                                                                         */
	hdsivideo_handle.LPHorizontalFrontPorchEnable = DSI_LP_HFP_ENABLE;   /* Allow sending LP commands during HFP period */
	hdsivideo_handle.LPHorizontalBackPorchEnable  = DSI_LP_HBP_ENABLE;   /* Allow sending LP commands during HBP period */
	hdsivideo_handle.LPVerticalActiveEnable = DSI_LP_VACT_ENABLE;  /* Allow sending LP commands during VACT period */
	hdsivideo_handle.LPVerticalFrontPorchEnable = DSI_LP_VFP_ENABLE;   /* Allow sending LP commands during VFP period */
	hdsivideo_handle.LPVerticalBackPorchEnable = DSI_LP_VBP_ENABLE;   /* Allow sending LP commands during VBP period */
	hdsivideo_handle.LPVerticalSyncActiveEnable = DSI_LP_VSYNC_ENABLE; /* Allow sending LP commands during VSync = VSA period */

	/* Configure DSI Video mode timings with settings set above */
	HAL_DSI_ConfigVideoMode(&(hdsi_eval), &(hdsivideo_handle));

	/* Configure DSI PHY HS2LP and LP2HS timings */
	PhyTimings.ClockLaneHS2LPTime = 35;
	PhyTimings.ClockLaneLP2HSTime = 35;
	PhyTimings.DataLaneHS2LPTime = 35;
	PhyTimings.DataLaneLP2HSTime = 35;
	PhyTimings.DataLaneMaxReadTime = 0;
	PhyTimings.StopWaitTime = 10;
	HAL_DSI_ConfigPhyTimer(&hdsi_eval, &PhyTimings);

